app/views/articulos/index.html.erb

    <td><%= articulo.cuerpo %></td>
    <td><%= articulo.comentarios.size %></td>
---
SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."articulo_id" = 1